application/greatleaf/frontend/controllers/OvertimeController.php

    public function actionCreate()
    {
        $model = new Overtime();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `overtime` (`startdate`, `enddate`, `duration`, `reason`, `status`, `author`, `requestdate`) VALUES ('2015-04-10', '2015-04-12', '2 Days', 'Need more money', 'P', 'Evan Specter', '2015-09-08')

    protected function findModel($id)
    {
        if (($model = Overtime::findOne($id)) !== null) {
---
SELECT * FROM `overtime` WHERE `id`='1'